Revit 2024 API
PolyLine.Evaluate Method
Evaluates a parameter on the polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Evaluate(
	double param
)
Visual Basic
Public Function Evaluate ( _
	param As Double _
) As XYZ
Visual C++
public:
XYZ^ Evaluate(
	double param
)
Parameters
param
Type: System.Double
The parameter to be evaluated. It is expected to be in [0,1] interval mapped to the bounds of the whole polyline.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  Thrown when the param value is not between 0.0 and 1.0.
See Also
PolyLine Class
Autodesk.Revit.DB Namespace